In [43]:
import pandas as pd

In [44]:
##Reading the csv file from pandas
df=pd.read_csv('sales_data_sample.csv')

In [45]:
df.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
1,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
2,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
3,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium
4,10168,36,96.66,1,3479.76,10/28/2003 0:00,Shipped,4,10,2003,...,9408 Furth Circle,NaN,Burlingame,CA,94217,USA,NaN,Hirano,Juri,Medium

In [46]:
##Exploratory data analysis
df.columns

Index(['ORDERNUMBER', ' QUANTITYORDERED', 'PRICEEACH', 'ORDERLINENUMBER',
       'SALES', 'ORDERDATE', 'STATUS', 'QTR_ID', 'MONTH_ID', 'YEAR_ID',
       'PRODUCTLINE', 'MSRP', 'PRODUCTCODE', 'CUSTOMERNAME', 'PHONE',
       'ADDRESSLINE1', 'ADDRESSLINE2', 'CITY', 'STATE', 'POSTALCODE',
       'COUNTRY', 'TERRITORY', 'CONTACTLASTNAME', 'CONTACTFIRSTNAME',
       'DEALSIZE'],
      dtype='object')

In [47]:
## analysing dataset information 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2822 entries, 0 to 2821
Data columns (total 25 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ORDERNUMBER       2822 non-null   int64
 1    QUANTITYORDERED  2822 non-null   int64
 2   PRICEEACH         2822 non-null   float64
 3   ORDERLINENUMBER   2822 non-null   int64
 4   SALES             2822 non-null   float64
 5   ORDERDATE         2822 non-null   object
 6   STATUS            2822 non-null   object
 7   QTR_ID            2822 non-null   int64
 8   MONTH_ID          2822 non-null   int64
 9   YEAR_ID           2822 non-null   int64
 10  PRODUCTLINE       2822 non-null   object
 11  MSRP              2822 non-null   int64
 12  PRODUCTCODE       2822 non-null   object
 13  CUSTOMERNAME      2822 non-null   object
 14  PHONE             2822 non-null   object
 15  ADDRESSLINE1      2822 non-null   object
 16  ADDRESSLINE2      302 non-null    object
 17  CITY              2822 non-null   object
 18  STATE             1336 non-null   object
 19  POSTALCODE        2746 non-null   object
 20  COUNTRY           2822 non-null   object
 21  TERRITORY         1749 non-null   object
 22  CONTACTLASTNAME   2822 non-null   object
 23  CONTACTFIRSTNAME  2822 non-null   object
 24  DEALSIZE          2822 non-null   object
dtypes: float64(2), int64(7), object(16)
memory usage: 551.3+ KB

In [48]:
##selecting the different columns for analysis
newdf=df[['SALES','ORDERDATE','STATUS','PRODUCTLINE','COUNTRY','DEALSIZE']]

In [49]:
newdf.head()

     SALES        ORDERDATE   STATUS  PRODUCTLINE COUNTRY DEALSIZE
0  2765.90    5/7/2003 0:00  Shipped  Motorcycles  France    Small
1  3884.34    7/1/2003 0:00  Shipped  Motorcycles  France   Medium
2  3746.70   8/25/2003 0:00  Shipped  Motorcycles     USA   Medium
3  5205.27  10/10/2003 0:00  Shipped  Motorcycles     USA   Medium
4  3479.76  10/28/2003 0:00  Shipped  Motorcycles     USA   Medium

In [50]:
##checking for null or nan values 
newdf.isnull().sum()

SALES          0
ORDERDATE      0
STATUS         0
PRODUCTLINE    0
COUNTRY        0
DEALSIZE       0
dtype: int64

In [51]:
newdf.isnull().count()

SALES          2822
ORDERDATE      2822
STATUS         2822
PRODUCTLINE    2822
COUNTRY        2822
DEALSIZE       2822
dtype: int64

In [52]:
newdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2822 entries, 0 to 2821
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   SALES        2822 non-null   float64
 1   ORDERDATE    2822 non-null   object
 2   STATUS       2822 non-null   object
 3   PRODUCTLINE  2822 non-null   object
 4   COUNTRY      2822 non-null   object
 5   DEALSIZE     2822 non-null   object
dtypes: float64(1), object(5)
memory usage: 132.4+ KB

In [53]:
##checking the data types
newdf.dtypes

SALES          float64
ORDERDATE       object
STATUS          object
PRODUCTLINE     object
COUNTRY         object
DEALSIZE        object
dtype: object

In [54]:
##Exploring the values in the colunm(STATUS)
newdf['STATUS'].value_counts()

STATUS
Shipped       2616
Cancelled       60
Resolved        47
On Hold         44
In Process      41
Disputed        14
Name: count, dtype: int64

In [55]:
##Exploring the values in the colunm(PRODUCTLINE)
newdf['PRODUCTLINE'].value_counts()

PRODUCTLINE
Classic Cars        967
Vintage Cars        607
Motorcycles         330
Planes              306
Trucks and Buses    301
Ships               234
Trains               77
Name: count, dtype: int64

In [56]:
##Exploring the values in the colunm(COUNTRY)
newdf['COUNTRY'].value_counts()

COUNTRY
USA            1003
Spain           342
France          314
Australia       185
UK              144
Italy           113
Finland          92
Norway           85
Singapore        79
Canada           70
Denmark          63
Germany          62
Sweden           57
Austria          55
Japan            52
Belgium          33
Switzerland      31
Philippines      26
Ireland          16
Name: count, dtype: int64

In [57]:
##Exploring the values in the colunm(DEALSIZE)
newdf['DEALSIZE'].value_counts()

DEALSIZE
Medium    1384
Small     1281
Large      157
Name: count, dtype: int64

In [58]:
##Converting Orderdate to DATETIME FORMATE
newdf['ORDERDATE']=pd.to_datetime(newdf['ORDERDATE'])

C:\Users\USER\AppData\Local\Temp\ipykernel_11040\1378688516.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf['ORDERDATE']=pd.to_datetime(newdf['ORDERDATE'])

In [59]:
newdf.head()

     SALES  ORDERDATE   STATUS  PRODUCTLINE COUNTRY DEALSIZE
0  2765.90 2003-05-07  Shipped  Motorcycles  France    Small
1  3884.34 2003-07-01  Shipped  Motorcycles  France   Medium
2  3746.70 2003-08-25  Shipped  Motorcycles     USA   Medium
3  5205.27 2003-10-10  Shipped  Motorcycles     USA   Medium
4  3479.76 2003-10-28  Shipped  Motorcycles     USA   Medium

In [60]:
newdf.tail()

        SALES  ORDERDATE    STATUS PRODUCTLINE  COUNTRY DEALSIZE
2817  2244.40 2004-12-02   Shipped       Ships    Spain    Small
2818  3978.51 2005-01-31   Shipped       Ships  Finland   Medium
2819  5417.57 2005-03-01  Resolved       Ships    Spain   Medium
2820  2116.16 2005-03-28   Shipped       Ships   France    Small
2821  3079.44 2005-05-06   On Hold       Ships      USA   Medium

In [61]:
newdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2822 entries, 0 to 2821
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   SALES        2822 non-null   float64
 1   ORDERDATE    2822 non-null   datetime64[ns]
 2   STATUS       2822 non-null   object
 3   PRODUCTLINE  2822 non-null   object
 4   COUNTRY      2822 non-null   object
 5   DEALSIZE     2822 non-null   object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 132.4+ KB

In [62]:
##Coverting and exporting to a CSV file
newdf.to_csv('CleanedDailySalaes-Analysis.csv')